#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_secretsmanager_secret.secret: Reading...
aws_route53_zone.thomaskimble_zone: Refreshing state... [id=Z06242472H0DG7GFLG30T]
aws_api_gateway_rest_api.thomaskimble_api: Refreshing state... [id=du08iuasl5]
aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/29037fba-829c-4870-9979-4b1574a8c6fd]
data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d393xlsrttjy5b]
aws_amplify_branch.dev: Refreshing state... [id=d393xlsrttjy5b/dev]
aws_amplify_branch.main: Refreshing state... [id=d393xlsrttjy5b/main]
aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_legacy_CNAME]
aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d393xlsrttjy5b/thomaskimble.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.thomaskimble_email_secureserver_record will be created
  + resource "aws_route53_record" "thomaskimble_email_secureserver_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "email"
      + records         = [
          + "email.secureserver.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z06242472H0DG7GFLG30T"
    }

  # aws_route53_record.thomaskimble_netorgft_record will be created
  + resource "aws_route53_record" "thomaskimble_netorgft_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "@"
      + records         = [
          + "NETORGFT11093738.onmicrosoft.com",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z06242472H0DG7GFLG30T"
    }

  # aws_route53_record.thomaskimble_outlook_autodiscover_record will be created
  + resource "aws_route53_record" "thomaskimble_outlook_autodiscover_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "autodiscover"
      + records         = [
          + "autodiscover.outlook.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z06242472H0DG7GFLG30T"
    }

  # aws_route53_record.thomaskimble_outlook_mx_record will be created
  + resource "aws_route53_record" "thomaskimble_outlook_mx_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "@"
      + records         = [
          + "0 thomaskimble-com.mail.protection.outlook.com",
        ]
      + ttl             = 300
      + type            = "MX"
      + zone_id         = "Z06242472H0DG7GFLG30T"
    }

  # aws_route53_record.thomaskimble_spf_record will be created
  + resource "aws_route53_record" "thomaskimble_spf_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "@"
      + records         = [
          + "v=spf1 include:secureserver.net -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z06242472H0DG7GFLG30T"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*